Project 3 - Part 3 (Core)
The project assignment is at the beginning of this week because you already have all of the background to complete project part 3 based on the first two weeks of the course!

Business Problem
For this project, you have been hired to produce a MySQL database on Movies from a subset of IMDB's publicly available dataset. Ultimately, you will use this database to analyze what makes a movie successful, and will provide recommendations to the stakeholder on how to make a successful movie.

Part 3
For part 3 of the project you will be practicing applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database.  You will export your database to a .sql file in your repository using MySQL Workbench.
Specifications - Database
Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project, and wants you to create a MySQL database for them.

You should normalize the tables as best you can before adding them to your new database.

Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).  
You only need to keep the imdb_id, revenue, budget, and certification columns
Required Transformation steps:
Normalize Genre:

Convert the single string of genres from title basics into 2 new tables.
title_genres: with the columns:

tconst
genre_id
genres:

genre_id
genre_name
Discard unnecessary information:

For the title basics table, drop the following columns:
"original_title" (we will use the primary title column instead)
"isAdult" ("Adult" will show up in the genres so this is redundant information).
"titleType" (every row will be a movie).
"genres" and other variants of genre (genre is now represented in the 2 new tables described above.
Do not include the title_akas table in your SQL database.
You have already filtered out the desired movies using this table and the remaining data is mostly nulls and not of-interest to the stakeholder.
MySQL Database Requirements
Use sqlalchemy with pandas to execute your SQL queries inside your notebook.

Create a new database on your MySQL server and call it "movies".

Make sure to have the following tables in your "movies" database:

title_basics
title_ratings
title_genres
genres
tmdb_data
Make sure to set a Primary Key for each table that isn't a joiner table (e.g. title_genres is a joiner table).

After creating each table, show the first 5 rows of that table using a SQL query.

Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

Deliverables
Submit a link to your github respository containing the Jupyter Notebook file.

In [835]:

#import necessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import json
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists

In [836]:
#load file and disply rows
df_title_basics = pd.read_csv('Data/basics_clean.csv.gz')
df_title_ratings = pd.read_csv('Data/title.ratings.csv.gz')

display(df_title_basics.head(), df_title_ratings.head())

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0034413,short,Youth Gets a Break,Youth Gets a Break,0,2001,NaN,20,Short
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
2,tt0040241,short,Color Rhapsodie,Color Rhapsodie,0,2021,NaN,6,Short
3,tt0044326,short,Abstronic,Abstronic,0,2021,NaN,6,Short
4,tt0044879,short,Mandala,Mandala,0,2021,NaN,3,Short

      tconst  averageRating  numVotes
0  tt0000001            5.7      1886
1  tt0000002            5.9       250
2  tt0000003            6.5      1673
3  tt0000004            5.8       163
4  tt0000005            6.2      2493

In [837]:
# Create a column with a list of genres
df_title_basics['genre_split'] = df_title_basics['genres'].str.split(',')
df_title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre_split
0,tt0034413,short,Youth Gets a Break,Youth Gets a Break,0,2001,NaN,20,Short,[Short]
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
2,tt0040241,short,Color Rhapsodie,Color Rhapsodie,0,2021,NaN,6,Short,[Short]
3,tt0044326,short,Abstronic,Abstronic,0,2021,NaN,6,Short,[Short]
4,tt0044879,short,Mandala,Mandala,0,2021,NaN,3,Short,[Short]

In [838]:
#separate list of genres into new rows
exploded_genres = df_title_basics.explode('genre_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre_split
0,tt0034413,short,Youth Gets a Break,Youth Gets a Break,0,2001,NaN,20,Short,Short
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
2,tt0040241,short,Color Rhapsodie,Color Rhapsodie,0,2021,NaN,6,Short,Short
...,...,...,...,...,...,...,...,...,...,...
470301,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
470301,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History
470302,tt9916720,short,The Nun 2,The Nun 2,0,2019,NaN,10,"Comedy,Horror,Mystery",Comedy
470302,tt9916720,short,The Nun 2,The Nun 2,0,2019,NaN,10,"Comedy,Horror,Mystery",Horror
470302,tt9916720,short,The Nun 2,The Nun 2,0,2019,NaN,10,"Comedy,Horror,Mystery",Mystery

In [839]:
#display unique genres
unique_genres = sorted(exploded_genres['genre_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [840]:
#save just tconst and genres_split as new df
title_genres = exploded_genres[['tconst', 'genre_split']].copy()
title_genres.head()

      tconst genre_split
0  tt0034413       Short
1  tt0035423      Comedy
1  tt0035423     Fantasy
1  tt0035423     Romance
2  tt0040241       Short

In [841]:
#make a genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [842]:
#make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genre_split'].map(genre_map)
title_genres = title_genres.drop(columns='genre_split')
title_genres.head()

      tconst  genre_id
0  tt0034413        20
1  tt0035423         5
1  tt0035423         9
1  tt0035423        18
2  tt0040241        20

In [843]:
#manually make dataframe with named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Saving SQL Database

In [844]:
##loading sql credentials
with open('/Users/staichn/.secret/mysql_api.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['user', 'password'])

In [845]:
# Create connection string using credentials following this format
## Change username and password to match your personal MySQL Server settings
connection_str = f"mysql+pymysql://{login['user']}:{login['password']}@localhost/Movies"
engine = create_engine(connection_str)

In [846]:
# Create Movies database, if it does not already exist
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [847]:
#display datatypes
df_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 470303 entries, 0 to 470302
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          470303 non-null  object
 1   titleType       470303 non-null  object
 2   primaryTitle    470303 non-null  object
 3   originalTitle   470303 non-null  object
 4   isAdult         470303 non-null  int64
 5   startYear       470303 non-null  int64
 6   endYear         9508 non-null    float64
 7   runtimeMinutes  470303 non-null  int64
 8   genres          470303 non-null  object
 9   genre_split     470303 non-null  object
dtypes: float64(1), int64(3), object(6)
memory usage: 35.9+ MB

In [848]:
#drop the unnecessary columns
df_title_basics = df_title_basics.drop(columns = ['titleType', 'originalTitle',
                                                  'isAdult', 'endYear', 'genres', 'genre_split'])
df_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 470303 entries, 0 to 470302
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          470303 non-null  object
 1   primaryTitle    470303 non-null  object
 2   startYear       470303 non-null  int64
 3   runtimeMinutes  470303 non-null  int64
dtypes: int64(2), object(2)
memory usage: 14.4+ MB

In [849]:
#calculate max string lengths
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = df_title_basics['tconst'].fillna('').map(len).max()
title_len = df_title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [850]:
#save the sql with dtype and index=False
df_title_basics.to_sql('title_basics', engine, dtype=df_schema,
                      if_exists = 'replace', index=False)

In [851]:
#update the table and column with sqlalchemy
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

# df_title_ratings

In [852]:
df_title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1251880 entries, 0 to 1251879
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1251880 non-null  object
 1   averageRating  1251880 non-null  float64
 2   numVotes       1251880 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.7+ MB

In [853]:
## Calculate max string lengths for object columns
key_len = df_title_ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating': Float(),
    'numVotes': Integer()}

In [854]:
#save to sql with dtype and index=False
df_title_ratings.to_sql('title_ratings', engine, dtype=df_schema,
                      if_exists = 'replace', index=False)

In [855]:
# Use the sqlalchemy engine to update the table and set tconst as the primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

title_genres

In [856]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 940082 entries, 0 to 470302
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    940082 non-null  object
 1   genre_id  940082 non-null  int64
dtypes: int64(1), object(1)
memory usage: 21.5+ MB

In [857]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id': Integer()}

In [858]:
#save to sql with dtype and index=false
title_genres.to_sql('title_genres', engine, dtype=df_schema, 
                   if_exists = 'replace', index=False)

Genres

In [859]:
genre_lookup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  26 non-null     object
 1   genre_id    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [860]:
## Calculate max string lengths for object columns
key_len = genre_lookup['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "genre_name": String(key_len+1), 
    'genre_id': Integer()}

In [861]:
#save to sql with dtype and index=false
genre_lookup.to_sql('genres', engine, dtype=df_schema,
                   if_exists = 'replace', index=False)

In [862]:
# Use the sqlalchemy engine to update the table and set genre_id as the primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

# TMDB

In [863]:
tmdb_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,3.095,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 51207, 'logo_path': None, 'name': 'Sul...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
1,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,Earth is in a state of constant war and two co...,1.802,/h9bWO13nWRGZJo4XVPiElXyrRMU.jpg,"[{'id': 7405, 'logo_path': '/rfnws0uY8rsNAsrLb...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-11-15,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN
2,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,"After falling prey to underworld, four friends...",0.600,/yB5wRu4uyXXwZA3PEj8cITu0xt3.jpg,[],"[{'iso_3166_1': 'IN', 'name': 'India'}]",2000-04-14,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
3,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,"Hong Kong, 1962: Chow Mo-Wan and Su Li-Zhen mo...",22.463,/iYypPT4bhqXfq1b6EnmxvRt6b2Y.jpg,"[{'id': 539, 'logo_path': None, 'name': 'Block...","[{'iso_3166_1': 'HK', 'name': 'Hong Kong'}]",2000-09-29,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1891.0,PG
4,tt0118852,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,"When Harry Levine, an aging, unsuccessful Gree...",5.340,/s6yQFnJohmvdkbeHbx6fFOTpYwR.jpg,"[{'id': 67930, 'logo_path': None, 'name': 'Cha...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-02,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.9,46.0,R

In [864]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3103 entries, 0 to 3102
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                3103 non-null   object
 1   adult                  3103 non-null   float64
 2   backdrop_path          1384 non-null   object
 3   belongs_to_collection  234 non-null    object
 4   budget                 3103 non-null   float64
 5   genres                 3103 non-null   object
 6   homepage               216 non-null    object
 7   id                     3103 non-null   float64
 8   original_language      3103 non-null   object
 9   original_title         3103 non-null   object
 10  overview               3038 non-null   object
 11  popularity             3103 non-null   float64
 12  poster_path            2685 non-null   object
 13  production_companies   3103 non-null   object
 14  production_countries   3103 non-null   object
 15  release_date           3078 non-null   object
 16  revenue                3103 non-null   float64
 17  runtime                3051 non-null   float64
 18  spoken_languages       3103 non-null   object
 19  status                 3103 non-null   object
 20  tagline                1268 non-null   object
 21  title                  3103 non-null   object
 22  video                  3103 non-null   float64
 23  vote_average           3103 non-null   float64
 24  vote_count             3103 non-null   float64
 25  certification          1119 non-null   object
dtypes: float64(9), object(17)
memory usage: 630.4+ KB

In [865]:
tmdb_df = tmdb_df.drop(columns = ['adult', 'backdrop_path','belongs_to_collection',
                               'genres', 'homepage', 'id', 'original_language', 
                              'original_title', 'overview', 'popularity', 
                              'poster_path', 'production_companies',
                               'production_countries', 'release_date', 
                              'runtime', 'spoken_languages', 'status', 
                              'tagline', 'title', 'video', 'vote_average', 
                              'vote_count'])
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3103 entries, 0 to 3102
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        3103 non-null   object
 1   budget         3103 non-null   float64
 2   revenue        3103 non-null   float64
 3   certification  1119 non-null   object
dtypes: float64(2), object(2)
memory usage: 97.1+ KB

In [866]:
# Calculate max string lengths for object columns ('tconst' and 'primaryTitle')
imdb_id_len = tmdb_df['imdb_id'].fillna('').map(len).max()

certification_len = tmdb_df['certification'].fillna('').map(len).max()



# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'imdb_id': String(imdb_id_len+1), 
    'budget':Float(), 
    'revenue':Float(),
    'certification': String(certification_len+1)}

In [867]:
tmdb_df['imdb_id'] != '0'

0       True
1       True
2       True
3       True
4       True
        ...
3098    True
3099    True
3100    True
3101    True
3102    True
Name: imdb_id, Length: 3103, dtype: bool

In [868]:
#save the sql with dtype and index=False
tmdb_df.to_sql('tmdb_df', engine, dtype=df_schema,
                      if_exists = 'replace', index=False)

In [869]:
# Use the sqlalchemy engine to update the table and set imdb_id as the primary key
engine.execute('ALTER TABLE tmdb_df ADD PRIMARY KEY (`imdb_id`);')

SQL Table and Rows

In [870]:
# Run show tables query
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4          tmdb_df

In [871]:
#genres
q = """
SELECT * 
FROM genres LIMIT 3
;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2

In [872]:
q = """
SELECT * 
FROM title_basics LIMIT 3
;"""
pd.read_sql(q, engine)

      tconst        primaryTitle  startYear  runtimeMinutes
0  tt0034413  Youth Gets a Break     2001.0              20
1  tt0035423      Kate & Leopold     2001.0             118
2  tt0040241     Color Rhapsodie     2021.0               6

In [873]:
q = """
SELECT * 
FROM title_genres LIMIT 3
;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0034413        20
1  tt0035423         5
2  tt0035423         9

In [874]:
q = """
SELECT * 
FROM title_ratings LIMIT 3
;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1886
1  tt0000002            5.9       250
2  tt0000003            6.5      1673

In [876]:
q = """
SELECT * 
FROM tmdb_df LIMIT 3
;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None

***************************************